# GetEvaluator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericValueRule..::..GetEvaluator Method
FilterNumericValueRule Class See Also
---
Gets the evaluator that implements the test for this rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterNumericRuleEvaluator GetEvaluator()
```

Visual Basic
---
```text
Public Function GetEvaluator As FilterNumericRuleEvaluator
```

Visual C++
---
```text
public:
FilterNumericRuleEvaluator^ GetEvaluator()
```

# See Also
FilterNumericValueRule Class
Autodesk.Revit.DB Namespace